app/controllers/msgthreads_controller.rb

        def index
            @msgthreads = Msgthread.all
---
SELECT "msgthreads".* FROM "msgthreads"